{
  "corrections": [
    {
      "original": "This paper presents an comprehensive overview of recent advancements in natural language processing.",
      "corrected": "This paper presents a comprehensive overview of recent advancements in natural language processing.",
      "explanation": "Article usage (a vs. an).",
      "type": "grammar"
    },
    {
      "original": "We will discuss the various aproaches that has been developed in the past decade.",
      "corrected": "We will discuss the various approaches that have been developed in the past decade.",
      "explanation": "Spelling ('aproaches' -> 'approaches') and subject-verb agreement with plural noun 'approaches'.",
      "type": "grammar"
    },
    {
      "original": "The field have grown exponentially, with new models being released on a regular bases.",
      "corrected": "The field has grown exponentially, with new models being released on a regular basis.",
      "explanation": "Subject-verb agreement ('field has') and correct word form ('basis' instead of 'bases' in this context).",
      "type": "grammar"
    },
    {
      "original": "Its important to understand these developments for anyone working in the field.",
      "corrected": "It's important to understand these developments for anyone working in the field.",
      "explanation": "Apostrophe use in contraction ('It's' vs 'Its').",
      "type": "grammar"
    },
    {
      "original": "In this study, we examined 50 different papers published between 2020-2023.",
      "corrected": "In this study, we examined 50 different papers published between 2020 and 2023.",
      "explanation": "Correct preposition pair 'between ... and ...'.",
      "type": "grammar"
    },
    {
      "original": "The data shows that transformer-based models is dominating the landscape.",
      "corrected": "The data shows that transformer-based models are dominating the landscape.",
      "explanation": "Subject-verb agreement with plural noun 'models'.",
      "type": "grammar"
    },
    {
      "original": "Each experiment were carefully designed to test specific aspects of model performance.",
      "corrected": "Each experiment was carefully designed to test specific aspects of model performance.",
      "explanation": "Subject-verb agreement with singular subject 'each experiment'.",
      "type": "grammar"
    },
    {
      "original": "In conclusion, this study have shown that the landscape of NLP is rapidly evolving.",
      "corrected": "In conclusion, this study has shown that the landscape of NLP is rapidly evolving.",
      "explanation": "Subject-verb agreement with singular subject 'study'.",
      "type": "grammar"
    },
    {
      "original": "Future work should focus on developing more efficent models.",
      "corrected": "Future work should focus on developing more efficient models.",
      "explanation": "Spelling ('efficent' -> 'efficient').",
      "type": "grammar"
    }
  ]
}
